node {
  name: "Placeholders/Input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "Placeholders/Label"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 10
        }
      }
    }
  }
}
node {
  name: "Placeholders/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "Layer_1/Weights/Layer_1_Weight/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\004\000\000\000\004\000\000\000\003\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "Layer_1/Weights/Layer_1_Weight/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Layer_1/Weights/Layer_1_Weight/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Layer_1/Weights/Layer_1_Weight/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Layer_1/Weights/Layer_1_Weight/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Layer_1/Weights/Layer_1_Weight/mul"
  op: "Mul"
  input: "Layer_1/Weights/Layer_1_Weight/TruncatedNormal"
  input: "Layer_1/Weights/Layer_1_Weight/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_1/Weights/Layer_1_Weight"
  op: "Add"
  input: "Layer_1/Weights/Layer_1_Weight/mul"
  input: "Layer_1/Weights/Layer_1_Weight/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_1/Weights/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 4
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Layer_1/Weights/Variable/Assign"
  op: "Assign"
  input: "Layer_1/Weights/Variable"
  input: "Layer_1/Weights/Layer_1_Weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_1/Weights/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Layer_1/Weights/Variable/read"
  op: "Identity"
  input: "Layer_1/Weights/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_1/Weights/Variable"
      }
    }
  }
}
node {
  name: "Layer_1/Weights/Layer_1_Weight_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Layer_1/Weights/Layer_1_Weight_1"
      }
    }
  }
}
node {
  name: "Layer_1/Weights/Layer_1_Weight_1"
  op: "HistogramSummary"
  input: "Layer_1/Weights/Layer_1_Weight_1/tag"
  input: "Layer_1/Weights/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_1/Biases/Layer_1_Bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Layer_1/Biases/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Layer_1/Biases/Variable/Assign"
  op: "Assign"
  input: "Layer_1/Biases/Variable"
  input: "Layer_1/Biases/Layer_1_Bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_1/Biases/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Layer_1/Biases/Variable/read"
  op: "Identity"
  input: "Layer_1/Biases/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_1/Biases/Variable"
      }
    }
  }
}
node {
  name: "Layer_1/Biases/Layer_1_Bias_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Layer_1/Biases/Layer_1_Bias_1"
      }
    }
  }
}
node {
  name: "Layer_1/Biases/Layer_1_Bias_1"
  op: "HistogramSummary"
  input: "Layer_1/Biases/Layer_1_Bias_1/tag"
  input: "Layer_1/Biases/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_1/Conv/Layer_1_Conv"
  op: "Conv2D"
  input: "Placeholders/Input"
  input: "Layer_1/Weights/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "Layer_1/add"
  op: "Add"
  input: "Layer_1/Conv/Layer_1_Conv"
  input: "Layer_1/Biases/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_1/Relu"
  op: "Relu"
  input: "Layer_1/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_1/Pool/Layer_1_Pool"
  op: "MaxPool"
  input: "Layer_1/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "Layer_2/Weights/Layer_2_Weight/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\004\000\000\000\004\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "Layer_2/Weights/Layer_2_Weight/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Layer_2/Weights/Layer_2_Weight/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Layer_2/Weights/Layer_2_Weight/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Layer_2/Weights/Layer_2_Weight/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Layer_2/Weights/Layer_2_Weight/mul"
  op: "Mul"
  input: "Layer_2/Weights/Layer_2_Weight/TruncatedNormal"
  input: "Layer_2/Weights/Layer_2_Weight/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_2/Weights/Layer_2_Weight"
  op: "Add"
  input: "Layer_2/Weights/Layer_2_Weight/mul"
  input: "Layer_2/Weights/Layer_2_Weight/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_2/Weights/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 4
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Layer_2/Weights/Variable/Assign"
  op: "Assign"
  input: "Layer_2/Weights/Variable"
  input: "Layer_2/Weights/Layer_2_Weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_2/Weights/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Layer_2/Weights/Variable/read"
  op: "Identity"
  input: "Layer_2/Weights/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_2/Weights/Variable"
      }
    }
  }
}
node {
  name: "Layer_2/Weights/Layer_2_Weight_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Layer_2/Weights/Layer_2_Weight_1"
      }
    }
  }
}
node {
  name: "Layer_2/Weights/Layer_2_Weight_1"
  op: "HistogramSummary"
  input: "Layer_2/Weights/Layer_2_Weight_1/tag"
  input: "Layer_2/Weights/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_2/Biases/Layer_2_Bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Layer_2/Biases/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Layer_2/Biases/Variable/Assign"
  op: "Assign"
  input: "Layer_2/Biases/Variable"
  input: "Layer_2/Biases/Layer_2_Bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_2/Biases/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Layer_2/Biases/Variable/read"
  op: "Identity"
  input: "Layer_2/Biases/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_2/Biases/Variable"
      }
    }
  }
}
node {
  name: "Layer_2/Biases/Layer_2_Bias_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Layer_2/Biases/Layer_2_Bias_1"
      }
    }
  }
}
node {
  name: "Layer_2/Biases/Layer_2_Bias_1"
  op: "HistogramSummary"
  input: "Layer_2/Biases/Layer_2_Bias_1/tag"
  input: "Layer_2/Biases/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_2/Conv/Layer_2_Conv"
  op: "Conv2D"
  input: "Layer_1/Pool/Layer_1_Pool"
  input: "Layer_2/Weights/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "Layer_2/add"
  op: "Add"
  input: "Layer_2/Conv/Layer_2_Conv"
  input: "Layer_2/Biases/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_2/Relu"
  op: "Relu"
  input: "Layer_2/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_2/Pool/Layer_2_Pool"
  op: "MaxPool"
  input: "Layer_2/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "Layer_3/Weights/Layer_3_Weight/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\004\000\000\000\004\000\000\000@\000\000\000\200\000\000\000"
      }
    }
  }
}
node {
  name: "Layer_3/Weights/Layer_3_Weight/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Layer_3/Weights/Layer_3_Weight/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Layer_3/Weights/Layer_3_Weight/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Layer_3/Weights/Layer_3_Weight/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Layer_3/Weights/Layer_3_Weight/mul"
  op: "Mul"
  input: "Layer_3/Weights/Layer_3_Weight/TruncatedNormal"
  input: "Layer_3/Weights/Layer_3_Weight/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_3/Weights/Layer_3_Weight"
  op: "Add"
  input: "Layer_3/Weights/Layer_3_Weight/mul"
  input: "Layer_3/Weights/Layer_3_Weight/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_3/Weights/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 4
        }
        dim {
          size: 64
        }
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Layer_3/Weights/Variable/Assign"
  op: "Assign"
  input: "Layer_3/Weights/Variable"
  input: "Layer_3/Weights/Layer_3_Weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_3/Weights/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Layer_3/Weights/Variable/read"
  op: "Identity"
  input: "Layer_3/Weights/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_3/Weights/Variable"
      }
    }
  }
}
node {
  name: "Layer_3/Weights/Layer_3_Weight_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Layer_3/Weights/Layer_3_Weight_1"
      }
    }
  }
}
node {
  name: "Layer_3/Weights/Layer_3_Weight_1"
  op: "HistogramSummary"
  input: "Layer_3/Weights/Layer_3_Weight_1/tag"
  input: "Layer_3/Weights/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_3/Biases/Layer_3_Bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 128
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Layer_3/Biases/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Layer_3/Biases/Variable/Assign"
  op: "Assign"
  input: "Layer_3/Biases/Variable"
  input: "Layer_3/Biases/Layer_3_Bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_3/Biases/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Layer_3/Biases/Variable/read"
  op: "Identity"
  input: "Layer_3/Biases/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Layer_3/Biases/Variable"
      }
    }
  }
}
node {
  name: "Layer_3/Biases/Layer_3_Bias_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Layer_3/Biases/Layer_3_Bias_1"
      }
    }
  }
}
node {
  name: "Layer_3/Biases/Layer_3_Bias_1"
  op: "HistogramSummary"
  input: "Layer_3/Biases/Layer_3_Bias_1/tag"
  input: "Layer_3/Biases/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_3/Conv/Layer_3_Conv"
  op: "Conv2D"
  input: "Layer_2/Pool/Layer_2_Pool"
  input: "Layer_3/Weights/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "Layer_3/add"
  op: "Add"
  input: "Layer_3/Conv/Layer_3_Conv"
  input: "Layer_3/Biases/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_3/Relu"
  op: "Relu"
  input: "Layer_3/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Layer_3/Pool/Layer_3_Pool"
  op: "MaxPool"
  input: "Layer_3/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "Fully_Connected/Flatten/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\000\010\000\000"
      }
    }
  }
}
node {
  name: "Fully_Connected/Flatten"
  op: "Reshape"
  input: "Layer_3/Pool/Layer_3_Pool"
  input: "Fully_Connected/Flatten/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\010\000\000\000\004\000\000"
      }
    }
  }
}
node {
  name: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight/mul"
  op: "Mul"
  input: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight/TruncatedNormal"
  input: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight"
  op: "Add"
  input: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight/mul"
  input: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/Weights/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2048
        }
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Fully_Connected/Weights/Variable/Assign"
  op: "Assign"
  input: "Fully_Connected/Weights/Variable"
  input: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Fully_Connected/Weights/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Fully_Connected/Weights/Variable/read"
  op: "Identity"
  input: "Fully_Connected/Weights/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Fully_Connected/Weights/Variable"
      }
    }
  }
}
node {
  name: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight_1"
      }
    }
  }
}
node {
  name: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight_1"
  op: "HistogramSummary"
  input: "Fully_Connected/Weights/Fully_Connected_Layer_1_Weight_1/tag"
  input: "Fully_Connected/Weights/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/Biases/Fully_Connected_Layer_1_Bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1024
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Fully_Connected/Biases/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Fully_Connected/Biases/Variable/Assign"
  op: "Assign"
  input: "Fully_Connected/Biases/Variable"
  input: "Fully_Connected/Biases/Fully_Connected_Layer_1_Bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Fully_Connected/Biases/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Fully_Connected/Biases/Variable/read"
  op: "Identity"
  input: "Fully_Connected/Biases/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Fully_Connected/Biases/Variable"
      }
    }
  }
}
node {
  name: "Fully_Connected/Biases/Fully_Connected_Layer_1_Bias_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Fully_Connected/Biases/Fully_Connected_Layer_1_Bias_1"
      }
    }
  }
}
node {
  name: "Fully_Connected/Biases/Fully_Connected_Layer_1_Bias_1"
  op: "HistogramSummary"
  input: "Fully_Connected/Biases/Fully_Connected_Layer_1_Bias_1/tag"
  input: "Fully_Connected/Biases/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/MatMul"
  op: "MatMul"
  input: "Fully_Connected/Flatten"
  input: "Fully_Connected/Weights/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Fully_Connected/add"
  op: "Add"
  input: "Fully_Connected/MatMul"
  input: "Fully_Connected/Biases/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Fully_Connected/sub"
  op: "Sub"
  input: "Fully_Connected/sub/x"
  input: "Placeholders/Placeholder"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/dropout/Shape"
  op: "Shape"
  input: "Fully_Connected/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Fully_Connected/dropout/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Fully_Connected/dropout/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Fully_Connected/dropout/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Fully_Connected/dropout/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Fully_Connected/dropout/random_uniform/sub"
  op: "Sub"
  input: "Fully_Connected/dropout/random_uniform/max"
  input: "Fully_Connected/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/dropout/random_uniform/mul"
  op: "Mul"
  input: "Fully_Connected/dropout/random_uniform/RandomUniform"
  input: "Fully_Connected/dropout/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/dropout/random_uniform"
  op: "Add"
  input: "Fully_Connected/dropout/random_uniform/mul"
  input: "Fully_Connected/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/dropout/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Fully_Connected/dropout/sub"
  op: "Sub"
  input: "Fully_Connected/dropout/sub/x"
  input: "Fully_Connected/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/dropout/truediv/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Fully_Connected/dropout/truediv"
  op: "RealDiv"
  input: "Fully_Connected/dropout/truediv/x"
  input: "Fully_Connected/dropout/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/dropout/GreaterEqual"
  op: "GreaterEqual"
  input: "Fully_Connected/dropout/random_uniform"
  input: "Fully_Connected/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/dropout/mul"
  op: "Mul"
  input: "Fully_Connected/add"
  input: "Fully_Connected/dropout/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Fully_Connected/dropout/Cast"
  op: "Cast"
  input: "Fully_Connected/dropout/GreaterEqual"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
}
node {
  name: "Fully_Connected/dropout/mul_1"
  op: "Mul"
  input: "Fully_Connected/dropout/mul"
  input: "Fully_Connected/dropout/Cast"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Output/Weights/raw_pred_Weight/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\004\000\000\n\000\000\000"
      }
    }
  }
}
node {
  name: "Output/Weights/raw_pred_Weight/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Output/Weights/raw_pred_Weight/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Output/Weights/raw_pred_Weight/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Output/Weights/raw_pred_Weight/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Output/Weights/raw_pred_Weight/mul"
  op: "Mul"
  input: "Output/Weights/raw_pred_Weight/TruncatedNormal"
  input: "Output/Weights/raw_pred_Weight/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Output/Weights/raw_pred_Weight"
  op: "Add"
  input: "Output/Weights/raw_pred_Weight/mul"
  input: "Output/Weights/raw_pred_Weight/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Output/Weights/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Output/Weights/Variable/Assign"
  op: "Assign"
  input: "Output/Weights/Variable"
  input: "Output/Weights/raw_pred_Weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/Weights/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Output/Weights/Variable/read"
  op: "Identity"
  input: "Output/Weights/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/Weights/Variable"
      }
    }
  }
}
node {
  name: "Output/Weights/raw_pred_Weight_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Output/Weights/raw_pred_Weight_1"
      }
    }
  }
}
node {
  name: "Output/Weights/raw_pred_Weight_1"
  op: "HistogramSummary"
  input: "Output/Weights/raw_pred_Weight_1/tag"
  input: "Output/Weights/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Output/Biases/raw_pred_Bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 10
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Output/Biases/Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Output/Biases/Variable/Assign"
  op: "Assign"
  input: "Output/Biases/Variable"
  input: "Output/Biases/raw_pred_Bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/Biases/Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Output/Biases/Variable/read"
  op: "Identity"
  input: "Output/Biases/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/Biases/Variable"
      }
    }
  }
}
node {
  name: "Output/Biases/raw_pred_Bias_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Output/Biases/raw_pred_Bias_1"
      }
    }
  }
}
node {
  name: "Output/Biases/raw_pred_Bias_1"
  op: "HistogramSummary"
  input: "Output/Biases/raw_pred_Bias_1/tag"
  input: "Output/Biases/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Output/MatMul"
  op: "MatMul"
  input: "Fully_Connected/dropout/mul_1"
  input: "Output/Weights/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Output/add"
  op: "Add"
  input: "Output/MatMul"
  input: "Output/Biases/Variable/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Output/Prediction/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Output/Prediction"
  op: "Mul"
  input: "Output/Prediction/x"
  input: "Output/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Shape"
  op: "Shape"
  input: "Output/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Rank_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Shape_1"
  op: "Shape"
  input: "Output/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Sub/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Sub"
  op: "Sub"
  input: "Loss_and_Optimizer/Softmax_loss/Rank_1"
  input: "Loss_and_Optimizer/Softmax_loss/Sub/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Slice/begin"
  op: "Pack"
  input: "Loss_and_Optimizer/Softmax_loss/Sub"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Slice/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Slice"
  op: "Slice"
  input: "Loss_and_Optimizer/Softmax_loss/Shape_1"
  input: "Loss_and_Optimizer/Softmax_loss/Slice/begin"
  input: "Loss_and_Optimizer/Softmax_loss/Slice/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/concat/values_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/concat"
  op: "ConcatV2"
  input: "Loss_and_Optimizer/Softmax_loss/concat/values_0"
  input: "Loss_and_Optimizer/Softmax_loss/Slice"
  input: "Loss_and_Optimizer/Softmax_loss/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Reshape"
  op: "Reshape"
  input: "Output/add"
  input: "Loss_and_Optimizer/Softmax_loss/concat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Rank_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Shape_2"
  op: "Shape"
  input: "Placeholders/Label"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Sub_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Sub_1"
  op: "Sub"
  input: "Loss_and_Optimizer/Softmax_loss/Rank_2"
  input: "Loss_and_Optimizer/Softmax_loss/Sub_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Slice_1/begin"
  op: "Pack"
  input: "Loss_and_Optimizer/Softmax_loss/Sub_1"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Slice_1/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Slice_1"
  op: "Slice"
  input: "Loss_and_Optimizer/Softmax_loss/Shape_2"
  input: "Loss_and_Optimizer/Softmax_loss/Slice_1/begin"
  input: "Loss_and_Optimizer/Softmax_loss/Slice_1/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/concat_1/values_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/concat_1/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/concat_1"
  op: "ConcatV2"
  input: "Loss_and_Optimizer/Softmax_loss/concat_1/values_0"
  input: "Loss_and_Optimizer/Softmax_loss/Slice_1"
  input: "Loss_and_Optimizer/Softmax_loss/concat_1/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Reshape_1"
  op: "Reshape"
  input: "Placeholders/Label"
  input: "Loss_and_Optimizer/Softmax_loss/concat_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss"
  op: "SoftmaxCrossEntropyWithLogits"
  input: "Loss_and_Optimizer/Softmax_loss/Reshape"
  input: "Loss_and_Optimizer/Softmax_loss/Reshape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Sub_2/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Sub_2"
  op: "Sub"
  input: "Loss_and_Optimizer/Softmax_loss/Rank"
  input: "Loss_and_Optimizer/Softmax_loss/Sub_2/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Slice_2/begin"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Slice_2/size"
  op: "Pack"
  input: "Loss_and_Optimizer/Softmax_loss/Sub_2"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Slice_2"
  op: "Slice"
  input: "Loss_and_Optimizer/Softmax_loss/Shape"
  input: "Loss_and_Optimizer/Softmax_loss/Slice_2/begin"
  input: "Loss_and_Optimizer/Softmax_loss/Slice_2/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Loss_and_Optimizer/Softmax_loss/Reshape_2"
  op: "Reshape"
  input: "Loss_and_Optimizer/Softmax_loss"
